tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"

# dev stuff
brew "direnv"
brew "git"
brew "htop"
brew "node"
brew "openssl@3"
brew "pyenv"
brew "readline"
brew "starship"
brew "tmux"
brew "tree"
brew "zig"
brew "zlib"

# apps
cask "beekeeper-studio"
cask "chromedriver"
cask "docker"
cask "drawio"
cask "eloston-chromium"
cask "figma"
cask "iterm2"
cask "miro"
cask "slack"
cask "visual-studio-code"
cask "yandex-music-unofficial"
cask "zoom"

# fonts
cask "font-blex-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
