tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# dev stuff
brew "direnv"
brew "git"
brew "htop"
brew "node"
brew "openssl@3"
brew "pyenv"
brew "readline"
brew "starship"
brew "tmux"
brew "tree"
brew "zig"
brew "zlib"

# apps
cask "anytype"
cask "beekeeper-studio"
cask "bitwarden"
cask "chromedriver"
cask "docker"
cask "eloston-chromium"
cask "figma"
cask "linearmouse"
cask "logseq"
cask "miniconda"
cask "miro"
cask "slack"
cask "telegram"
cask "tsh"
cask "visual-studio-code"
cask "zed"
cask "zoom"

# fonts
cask "font-blex-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
